--توی تیبل ها که میخوایم رابطه هارو ارائه بدیم میایم در دیزاینِ تیبل 
--کنار قسمت اسم هر سطون یک جدولی هست که با کلیک راست پرایمری کی میذاریم 
--همون جا میایم و کلیک راست میکنیم و رلیشنشیپز رو انتخاب میکنیم و یک کلید خارجی اد میکنیم 
--کلید خارجی میشود  برمبنای یکی از سطون های جدولی که الان داریم دیزاینش میکنیم 
--و پرایمری کی میشود بر اساس مقدار یکی از سطون های جدولی که مقدار را میخواهیم ازش بگیریم . 
--به اسم گذاری هم دقت کنیم  اول اف کی هست مخفف فارن کی و بعد اسم جدولی که فارن کی را دارد 
--و بعد اسم جدولی که پرایمری کی را دارد جدول هایی که رلیشن دارن با هم عمل میکنند یعنی
--نمیشود که از جدولی که پرایمری کی دارد مقداری را که مورد استفاده در سطون جدول فارن کی هست را حذف کنیم 
--حتی اگر ان سطونی که در جدولمان هاوی فارن کی هست مقدار نال برایش مجاز باشد 
--ولی اگر استفاده نشده باشد چرا قابل حذف است
--هم چنین ما نمیتوانیم به سطون جدولی که فارن کی دارد مقداری را بدهیم که در سطون جدول پرایمری کی وجود ندارد
--حتی اگر مقدار نال مجاز باشد در سطونی از جدولمان که هاوی فارن کی است
--مگر،مگر کلا رلیشنشیپبی وجود نداشته باشد

--پس میتونیم از جدول فارن کی اطلاعاتی را حذفش کنیم و دیگر استفاده نکنیم کلا ان ردیف را
--لپ کلام این که پرایمری ها اطلاعاتشان غیر قابل حذف شدن هست و فارن کی ها حتما باید از مقادیر پرایمری ها استفاده کنند

--اون سطونی که ازش اطلاعاتش رو میگیریم و میریزیم اون اطلاعات را درون سطونی از جدول جدیدمان میشود پرایمری کی
--اون سطونی که اطلاعاتش با اطلاعات سطونی از جدول دیگر پرمیشود میشود فارن کی
--سطون های فارن کی با اطلاعات سطون های پرایمری پر میشوند
--هر جدول چندتا فارن کی دارد ولی یک پرایمری کی دارد


--NOT NULL: به ستون ها اجازه نمی دهد که مقدار NULL داشته باشند.
--UNIQUE: می گوید تمام مقادیر یک ستون باید متفاوت باشند.
--PRIMARY KEY: ترکیبی از NULL و UNIQUE است و کار تشخیص ردیف های خاص را بر عهده دارد.
--FOREIGN KEY: کار تشخیص ردیف های خاص از یک جدول دیگر را بر عهده دارد.


